posts/c-memory-management.org
#+BEGIN_COMMENT
.. title: C Memory Management
.. slug: c-memory-management
.. date: 2021-02-12 08:37:35 UTC+08:00
.. tags: C, Memory Management
.. category: Programming Language
.. link: 
.. description: 
.. type: text

#+END_COMMENT

* C 语言内存管理

* 关键字

  | *关键字*        | *存储类别*             | *存储期* | *作用域* | *链接* | *声明方式* |
  |-----------------+------------------------+----------+----------+--------+------------|
  | 可选 (=auto=)   | 自动                   | 自动     | 块       | 无     | 块内       |
  | =register=      | 寄存器                 | 自动     | 块       | 无     | 块内       |
  | 无              | 静态外部链接           | 静态     | 文件     | 外部   | 函数外     |
  | =static=        | 静态内部链接           | 静态     | 文件     | 内部   | 函数外     |
  | =static=        | 静态无链接             | 静态     | 块       | 无     | 块内       |
  | =extern=        | 外部                   |          |          |        |            |
  | =_Thread_local= |                        |          |          |        |            |
  | =const=         | 不可变                 |          |          |        |            |
  | =inline=        |                        |          |          |        |            |
  | =volatile=      | 代理，可由其它程序改变 |          |          |        |            |
  | =restrict=      | 限定唯一的指针         |          |          |        |            |
  | =_Atomic=       |                        |          |          |        |            |


  1. 好的设计不应该使用文件作用域的变量
  2. =auto= 关键字用于明确显示使用了与外部同名的变量名，与 c++ 中的完全不同，不建议使用
  3. 函数的默认类别是 =extern= 除非使用了 =static= 指定为模块私有
  4. =static= 静态指的是生命周期一直在， =const= 才是不可变
  5. =const= 变量只能初始化，不能修改
  6. =const float * pf= 指针 =pf= 指向 =const float= 类型的对象，即对象内容不可变，但指针可以指向其它地址
  7. =float const * pf= 同上
  8. =float * const pf= 指针 =pf= 指向 =float= 类型的对象，即对象内容可变，但指针不能指向其它地址
  9. 即 =const= 在 =*= 前面表示指向的值不能变，在 =*= 后面表示指针本身不能变
  10. 函数的形参中有 =const= 表示传递的值不变
  11. =restrict= 限制指针是指向内存的唯一和初始方式，用于优化

     
* 
