posts/c-memory-management/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>C Memory Management | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/c-memory-management/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../pandas/" title="pandas" type="text/html">
<link rel="next" href="../sagemath/" title="SageMath" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="C Memory Management">
<meta property="og:url" content="https://chimez.github.io/posts/c-memory-management/">
<meta property="og:description" content="C 语言内存管理



关键字



















关键字
存储类别
存储期
作用域
链接
声明方式




可选 (auto)
自动
自动
块
无
块内



register
寄存器
自动
块
无
块内



无
静态外部链接
静态
文件
外部
函数外



static
静态内部链接
静态
文件
内部
函数外



static
静态无链接
静态
块
无
块内



ext">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-02-12T08:37:35+08:00">
<meta property="article:tag" content="C">
<meta property="article:tag" content="Memory Management">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">C Memory Management</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-02-12T08:37:35+08:00" itemprop="datePublished" title="2021-02-12 08:37">2021-02-12 08:37</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org5940465" class="outline-2">
<h2 id="org5940465">C 语言内存管理</h2>
</div>

<div id="outline-container-orgdbb935c" class="outline-2">
<h2 id="orgdbb935c">关键字</h2>
<div class="outline-text-2" id="text-orgdbb935c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left"><b>关键字</b></th>
<th scope="col" class="org-left"><b>存储类别</b></th>
<th scope="col" class="org-left"><b>存储期</b></th>
<th scope="col" class="org-left"><b>作用域</b></th>
<th scope="col" class="org-left"><b>链接</b></th>
<th scope="col" class="org-left"><b>声明方式</b></th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">可选 (<code>auto</code>)</td>
<td class="org-left">自动</td>
<td class="org-left">自动</td>
<td class="org-left">块</td>
<td class="org-left">无</td>
<td class="org-left">块内</td>
</tr>
<tr>
<td class="org-left"><code>register</code></td>
<td class="org-left">寄存器</td>
<td class="org-left">自动</td>
<td class="org-left">块</td>
<td class="org-left">无</td>
<td class="org-left">块内</td>
</tr>
<tr>
<td class="org-left">无</td>
<td class="org-left">静态外部链接</td>
<td class="org-left">静态</td>
<td class="org-left">文件</td>
<td class="org-left">外部</td>
<td class="org-left">函数外</td>
</tr>
<tr>
<td class="org-left"><code>static</code></td>
<td class="org-left">静态内部链接</td>
<td class="org-left">静态</td>
<td class="org-left">文件</td>
<td class="org-left">内部</td>
<td class="org-left">函数外</td>
</tr>
<tr>
<td class="org-left"><code>static</code></td>
<td class="org-left">静态无链接</td>
<td class="org-left">静态</td>
<td class="org-left">块</td>
<td class="org-left">无</td>
<td class="org-left">块内</td>
</tr>
<tr>
<td class="org-left"><code>extern</code></td>
<td class="org-left">外部</td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>_Thread_local</code></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>const</code></td>
<td class="org-left">不可变</td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>inline</code></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>volatile</code></td>
<td class="org-left">代理，可由其它程序改变</td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>restrict</code></td>
<td class="org-left">限定唯一的指针</td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
<tr>
<td class="org-left"><code>_Atomic</code></td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
<td class="org-left"> </td>
</tr>
</tbody>
</table>
<ol class="org-ol">
<li>好的设计不应该使用文件作用域的变量</li>
<li>
<code>auto</code> 关键字用于明确显示使用了与外部同名的变量名，与 c++ 中的完全不同，不建议使用</li>
<li>函数的默认类别是 <code>extern</code> 除非使用了 <code>static</code> 指定为模块私有</li>
<li>
<code>static</code> 静态指的是生命周期一直在， <code>const</code> 才是不可变</li>
<li>
<code>const</code> 变量只能初始化，不能修改</li>
<li>
<code>const float * pf</code> 指针 <code>pf</code> 指向 <code>const float</code> 类型的对象，即对象内容不可变，但指针可以指向其它地址</li>
<li>
<code>float const * pf</code> 同上</li>
<li>
<code>float * const pf</code> 指针 <code>pf</code> 指向 <code>float</code> 类型的对象，即对象内容可变，但指针不能指向其它地址</li>
<li>即 <code>const</code> 在 <code>*</code> 前面表示指向的值不能变，在 <code>*</code> 后面表示指针本身不能变</li>
<li>函数的形参中有 <code>const</code> 表示传递的值不变</li>
<li>
<code>restrict</code> 限制指针是指向内存的唯一和初始方式，用于优化</li>
</ol>
</div>
</div>


<div id="outline-container-org9823553" class="outline-2">
<h2 id="org9823553"></h2>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/c/" rel="tag">C</a></li>
            <li><a class="tag p-category" href="../../categories/memory-management/" rel="tag">Memory Management</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../pandas/" rel="prev" title="pandas">Previous post</a>
            </li>
            <li class="next">
                <a href="../sagemath/" rel="next" title="SageMath">Next post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
